multiSpeciesMassTransportLibrary/testCase/modifiedReactingFoam_pure_diff/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";


    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform (0.0 0 0);
    }

    inletFuel        
    {
        type            fixedValue;
        value           uniform (0.0 0 0);
    }

    outlet          
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wallBetween
    {
       type            fixedValue;
        value           uniform (0 0 0);
    }

    side
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
