multiSpeciesMassTransportLibrary/testCase/modifiedReactingFoam_pure_diff/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3410
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inletAir
    {
        type            zeroGradient;
    }
    inletFuel
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    side
    {
        type            symmetryPlane;
    }
    wallBetween
    {
        type            zeroGradient;
    }
    down
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
