multiSpeciesMassTransportLibrary/testCase/modifiedReactingFoam_pure_diff/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";


    class volScalarField;
    object T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inletAir
    {
         type           zeroGradient;
    }

    inletFuel        
    {
         type           zeroGradient;
    }

    outlet          
    {
          
       type            zeroGradient;
    }


    wallBetween
    {
        type            zeroGradient;
    }

    side
    {
        type            symmetryPlane;
	//type            symmetry;
    }

    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
